<template lang="pug">
  .page.index.wrapper
    vCategory(
      v-for="(category, index) in categories"
      :key="index"
      :data="category")
    modalCreateCategory
    modalEditCategory
    modalEditArticle
    modalDeleteCategory
</template>

<script>
import { mapState } from 'vuex'
import vCategory from '@/components/category'
import modalCreateCategory from '@/components/modal-create-category'
import modalEditCategory from '@/components/modal-edit-category'
import modalDeleteCategory from '@/components/modal-delete-category'
import modalEditArticle from '@/components/modal-edit-article'

export default {
  name: 'page-index',
  components: {
    vCategory,
    modalCreateCategory,
    modalEditCategory,
    modalDeleteCategory,
    modalEditArticle
  },
  data() {
    return {
      categories: [
        {
          title: 'Название категории',
          articles: [
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            }
          ]
        },
        {
          title: 'Название категории',
          articles: [
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            }
          ]
        },
        {
          title: 'Название категории',
          articles: [
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            }
          ]
        },
        {
          title: 'Название категории',
          articles: [
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            }
          ]
        }
      ]
    }
  },
  computed: {
    ...mapState({
      modals: state => state.modals
    })
  }
}
</script>

<style lang="scss">
.index {
  padding-top: 48px;
  display: flex;
  flex-direction: column;
  gap: 48px;
}
</style>
