<template lang="pug">
  .page.index.wrapper
    vCategory(
      v-for="(category, index) in categories"
      :key="index"
      :data="category")
</template>

<script>
import vCategory from '@/components/category'

export default {
  name: 'page-index',
  components: {
    vCategory
  },
  data() {
    return {
      categories: [
        {
          title: 'Название категории',
          articles: [
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            }
          ]
        },
        {
          title: 'Название категории',
          articles: [
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            }
          ]
        },
        {
          title: 'Название категории',
          articles: [
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            }
          ]
        },
        {
          title: 'Название категории',
          articles: [
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            },
            {
              likesQuantity: 40,
              title: 'Заголовок',
              subtitle:
                // eslint-disable-next-line max-len
                'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.'
            }
          ]
        }
      ]
    }
  }
}
</script>

<style lang="scss">
.index {
  padding-top: 48px;
  display: flex;
  flex-direction: column;
  gap: 48px;
}
</style>
